## MySQL DB server
One of the most used Database management system (DBMS) server 

Install MySQL On macOS: https://flaviocopes.com/mysql-how-to-install/

### Start MySQL in Terminal
`brew services start mysql`  
`mysql -u root -p`

In [7]:
import mysql.connector

In [8]:
mydb = mysql.connector.connect(
    host = '127.0.0.1',
    username = 'root',
    password = '123456'
)
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x10ad2e160>

In [10]:
mycursor = mydb.cursor()
# mycursor.execute('CREATE DATABASE mydatabase')

In [16]:
mycursor.execute('SHOW DATABASES')

In [17]:
for x in mycursor:
    print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('newdatabse',)
('performance_schema',)
('sys',)

# specify a database

In [19]:
mydb = mysql.connector.connect(
    host = '127.0.0.1',
    username = 'root',
    password = '123456',
    database = 'mydatabase'
)
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x10ad2ee20>

In [21]:
mycursor = mydb.cursor()

In [25]:
mycursor.execute('SHOW TABLES')

In [26]:
for x in mycursor:
    print(x)

('customers',)

In [50]:
import pandas as pd

In [58]:
mycursor.execute('SELECT * FROM customers')
results = mycursor.fetchall()

# fetch name column names
num_fields = len(mycursor.description)
field_names = [i[0] for i in mycursor.description]

new = pd.DataFrame(results, columns =field_names )

In [59]:
new

    id     name          address
0    1     Join       Highway 21
1    2    Peter      Lowstreet 4
2    3      Amy     Apple st 652
3    4   Hannah      Mountain 21
4    5  Michael       Valley 345
5    6    Sandy     Ocean blvd 2
6    7    Betty    Green Grass 1
7    8  Richard       Sky st 331
8    9    Susan       One way 98
9   10    Vicky  Yellow Garden 2
10  11      Ben     Park Lane 38
11  12  William   Central st 954
12  13    Chuck    Main Road 989
13  14    Viola     Sideway 1633

In [54]:
num_fields = len(mycursor.description)
field_names = [i[0] for i in mycursor.description]

In [55]:
field_names

['id', 'name', 'address']